saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.TXZ3_DFP.1.2.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>TXZ3_DFP</name>
  <description>Toshiba TXZ3 Series Group(1),Group(2) Device Support</description>

  <releases>
    <release version="1.2.0" date="2018-07-13">
      According to the data sheet, split for 2 Groups:M3H(1),M3H(2)
      M3H(1):TMPM3H6, TMPM3H5, TMPM3H4, TMPM3H3, TMPM3H2, TMPM3H1, TMPM3H0
      M3H(2):TMPM3HQ, TMPM3HP, TMPM3HN, TMPM3HM, TMPM3HL, TMPM3HN_L
      Device support added for TMPM3HL(TMPM3HLFDUG,TMPM3HLFZUG,TMPM3HLFYUG),TMPM3HN_L(TMPM3HNFDLFG,TMPM3HNFYLFG)
    </release>
    <release version="1.1.0" date="2018-02-05">
      Device support added for TMPM3HQ, TMPM3HP, TMPM3HN, TMPM3HM, TMPM3H5, TMPM3H4, TMPM3H3, TMPM3H2, TMPM3H1, TMPM3H0 devices
      Updated Device support for all devices: header files and SVDs.
    </release>
    <release version="1.0.0" date="2016-06-27">
      First Release version of TXZ3 Series Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Toshiba</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Toshiba</keyword>
    <keyword>TMPM3</keyword>
    <keyword>TXZ3</keyword>
  </keywords>

  <devices>
    <family Dfamily="TXZ3 Series" Dvendor="Toshiba:92">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="0" Dmpu="1" Dendian="Little-endian"/>
      <book name="Documents/dui0552a_cortex_m3_dgug.pdf" title="Cortex-M3 Generic User Guide"/>
      <description>
The TXZ3 microcontroller series embeds an ARM Cortex-M3 core, which provides high code density and fast interrupt response times required for real-time applications.
      </description>

      <!-- ************************  Subfamily 'M3H(1)'  **************************** -->
      <subFamily DsubFamily="M3H(1)">

        <!-- ***********************  Device 'TMPM3H6FWFG'  ************************* -->
        <device Dname="TMPM3H6FWFG">
          <processor Dclock="40000000"/>
          <compile header="Device/Include/TMPM3Hx.h" define="TMPM3H6FWFG"/>
          <debug svd="SVD/M3H6.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM3Hx_code_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/TMPM3Hx_data_32.FLM"  start="0x30000000" size="0x00008000"             default="1"/>

          <!--book name=""/-->

          <feature type="IOs"           n="87"                          name="I/O Ports (PORT)"/>
          <feature type="ExtInt"        n="16"                          name="External interrupt (INT)"/>
          <feature type="CoreOther"     n="1"                           name="Digital Noise Filter (DNF)"/>
          <feature type="DMA"           n="1"                           name="Direct Memory Access Controllor (DMAC)"/>
          <feature type="Timer"         n="6"      m="32"               name="32bit Timer Event counter (T32A)"/>
          <feature type="RTC"           n="1"      m="32768"            name="Real Time Clock (RTC)"/>
          <feature type="UART"          n="3"                           name="Universal Asynchronous Receiver Transmitter (UART)"/>
          <feature type="I2C"           n="3"                           name="Inter-Integrated Circuit (I2C)"/>
          <feature type="SPI"           n="2"                           name="Toshiba Serial Peripheral Interface (TSPI/SIO)"/>
          <feature type="ADC"           n="16"     m="12"               name="Analog to Digital Converter (ADC)"/>
          <feature type="DAC"           n="2"      m="8"                name="Digital to Analog Converter (DAC)"/>
          <feature type="CoreOther"     n="1"                           name="Advanced Encoder input Circuit (A-ENC)"/>
          <feature type="CoreOther"     n="1"                           name="Programmable Motor Driver Plus (PMD+)"/>
          <feature type="Other"         n="1"                           name="Remote control preprocessor (RMC)"/>
          <feature type="PowerOther"    n="1"                           name="Low-Voltage Detector (LVD)"/>
          <feature type="WDT"           n="1"                           name="Selectable clock Watch dog timer (SIWDT)"/>
          <feature type="Other"         n="1"                           name="Oscillation Frequency Detector (OFD)"/>
          <feature type="PowerOther"    n="1"                           name="Power-on Reset Circuit (POR)"/>
          <feature type="VCC"           n="2.70"   m="5.50"/>
          <feature type="Temp"          n="-40"    m="85"/>
          <feature type="QFP"          n="100"    name="LQFP100-P-1414-0.50H"/>
        </device>

        <!-- ***********************  Device 'TMPM3H6FUFG'  ************************* -->
        <device Dname="TMPM3H6FUFG">
          <processor Dclock="40000000"/>
          <compile header="Device/Include/TMPM3Hx.h" define="TMPM3H6FUFG"/>
          <debug svd="SVD/M3H6.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00018000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x20000000" size="0x00003000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM3Hx_code_96.FLM"  start="0x00000000" size="0x00018000"             default="1"/>
          <algorithm name="Flash/TMPM3Hx_data_32.FLM"  start="0x30000000" size="0x00008000"             default="1"/>

          <!--book name=""/-->

          <feature type="IOs"           n="87"                          name="I/O Ports (PORT)"/>
          <feature type="ExtInt"        n="16"                          name="External interrupt (INT)"/>
          <feature type="CoreOther"     n="1"                           name="Digital Noise Filter (DNF)"/>
          <feature type="DMA"           n="1"                           name="Direct Memory Access Controllor (DMAC)"/>
          <feature type="Timer"         n="6"      m="32"               name="32bit Timer Event counter (T32A)"/>
          <feature type="RTC"           n="1"      m="32768"            name="Real Time Clock (RTC)"/>
          <feature type="UART"          n="3"                           name="Universal Asynchronous Receiver Transmitter (UART)"/>
          <feature type="I2C"           n="3"                           name="Inter-Integrated Circuit (I2C)"/>
          <feature type="SPI"           n="2"                           name="Toshiba Serial Peripheral Interface (TSPI/SIO)"/>
          <feature type="ADC"           n="16"     m="12"               name="Analog to Digital Converter (ADC)"/>
          <feature type="DAC"           n="2"      m="8"                name="Digital to Analog Converter (DAC)"/>
          <feature type="CoreOther"     n="1"                           name="Advanced Encoder input Circuit (A-ENC)"/>
          <feature type="CoreOther"     n="1"                           name="Programmable Motor Driver Plus (PMD+)"/>
          <feature type="Other"         n="1"                           name="Remote control preprocessor (RMC)"/>
          <feature type="PowerOther"    n="1"                           name="Low-Voltage Detector (LVD)"/>
          <feature type="WDT"           n="1"                           name="Selectable clock Watch dog timer (SIWDT)"/>
          <feature type="Other"         n="1"                           name="Oscillation Frequency Detector (OFD)"/>
          <feature type="PowerOther"    n="1"                           name="Power-on Reset Circuit (POR)"/>
          <feature type="VCC"           n="2.70"   m="5.50"/>
          <feature type="Temp"          n="-40"    m="85"/>
          <feature type="QFP"          n="100"    name="LQFP100-P-1414-0.50H"/>
        </device>

