saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.TXZ3_DFP.1.2.0.pdsc
          <feature type="IOs"           n="40"                          name="I/O Ports (PORT)"/>
          <feature type="ExtInt"        n="7"                           name="External interrupt (INT)"/>
          <feature type="CoreOther"     n="1"                           name="Digital Noise Filter (DNF)"/>
          <feature type="DMA"           n="1"                           name="Direct Memory Access Controllor (DMAC)"/>
          <feature type="Timer"         n="6"      m="32"               name="32bit Timer Event counter (T32A)"/>
          <feature type="RTC"           n="1"      m="32768"            name="Real Time Clock (RTC)"/>
          <feature type="UART"          n="3"                           name="Universal Asynchronous Receiver Transmitter (UART)"/>
          <feature type="I2C"           n="2"                           name="Inter-Integrated Circuit (I2C)"/>
          <feature type="SPI"           n="2"                           name="Toshiba Serial Peripheral Interface (TSPI/SIO)"/>
          <feature type="ADC"           n="8"      m="12"               name="Analog to Digital Converter (ADC)"/>
          <feature type="DAC"           n="1"      m="8"                name="Digital to Analog Converter (DAC)"/>
          <feature type="CoreOther"     n="1"                           name="Advanced Encoder input Circuit (A-ENC)"/>
          <feature type="CoreOther"     n="1"                           name="Programmable Motor Driver Plus (PMD+)"/>
          <feature type="Other"         n="1"                           name="Remote control preprocessor (RMC)"/>
          <feature type="PowerOther"    n="1"                           name="Low-Voltage Detector (LVD)"/>
          <feature type="WDT"           n="1"                           name="Selectable clock Watch dog timer (SIWDT)"/>
          <feature type="Other"         n="1"                           name="Oscillation Frequency Detector (OFD)"/>
          <feature type="PowerOther"    n="1"                           name="Power-on Reset Circuit (POR)"/>
          <feature type="VCC"           n="2.70"   m="5.50"/>
          <feature type="Temp"          n="-40"    m="85"/>
          <feature type="QFP"          n="48"    name="LQFP48-P-0707-0.50C"/>
        </device>

        <!-- ***********************  Device 'TMPM3H2FWQG'  ************************* -->
        <device Dname="TMPM3H2FWQG">
          <processor Dclock="40000000"/>
          <compile header="Device/Include/TMPM3Hx.h" define="TMPM3H2FWQG"/>
          <debug svd="SVD/M3H2.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM3Hx_code_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/TMPM3Hx_data_32.FLM"  start="0x30000000" size="0x00008000"             default="1"/>

          <!--book name=""/-->

          <feature type="IOs"           n="40"                          name="I/O Ports (PORT)"/>
          <feature type="ExtInt"        n="7"                           name="External interrupt (INT)"/>
          <feature type="CoreOther"     n="1"                           name="Digital Noise Filter (DNF)"/>
          <feature type="DMA"           n="1"                           name="Direct Memory Access Controllor (DMAC)"/>
          <feature type="Timer"         n="6"      m="32"               name="32bit Timer Event counter (T32A)"/>
          <feature type="RTC"           n="1"      m="32768"            name="Real Time Clock (RTC)"/>
          <feature type="UART"          n="3"                           name="Universal Asynchronous Receiver Transmitter (UART)"/>
          <feature type="I2C"           n="2"                           name="Inter-Integrated Circuit (I2C)"/>
          <feature type="SPI"           n="2"                           name="Toshiba Serial Peripheral Interface (TSPI/SIO)"/>
          <feature type="ADC"           n="8"      m="12"               name="Analog to Digital Converter (ADC)"/>
          <feature type="DAC"           n="1"      m="8"                name="Digital to Analog Converter (DAC)"/>
          <feature type="CoreOther"     n="1"                           name="Advanced Encoder input Circuit (A-ENC)"/>
          <feature type="CoreOther"     n="1"                           name="Programmable Motor Driver Plus (PMD+)"/>
          <feature type="Other"         n="1"                           name="Remote control preprocessor (RMC)"/>
          <feature type="PowerOther"    n="1"                           name="Low-Voltage Detector (LVD)"/>
          <feature type="WDT"           n="1"                           name="Selectable clock Watch dog timer (SIWDT)"/>
          <feature type="Other"         n="1"                           name="Oscillation Frequency Detector (OFD)"/>
          <feature type="PowerOther"    n="1"                           name="Power-on Reset Circuit (POR)"/>
          <feature type="VCC"           n="2.70"   m="5.50"/>
          <feature type="Temp"          n="-40"    m="85"/>
          <feature type="QFN"          n="48"    name="P-VQFN48-0606-0.40-003"/>
        </device>

        <!-- ***********************  Device 'TMPM3H2FUQG'  ************************* -->
        <device Dname="TMPM3H2FUQG">
          <processor Dclock="40000000"/>
          <compile header="Device/Include/TMPM3Hx.h" define="TMPM3H2FUQG"/>
          <debug svd="SVD/M3H2.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00018000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x20000000" size="0x00003000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM3Hx_code_96.FLM"  start="0x00000000" size="0x00018000"             default="1"/>
          <algorithm name="Flash/TMPM3Hx_data_32.FLM"  start="0x30000000" size="0x00008000"             default="1"/>

          <!--book name=""/-->

          <feature type="IOs"           n="40"                          name="I/O Ports (PORT)"/>
          <feature type="ExtInt"        n="7"                           name="External interrupt (INT)"/>
          <feature type="CoreOther"     n="1"                           name="Digital Noise Filter (DNF)"/>
          <feature type="DMA"           n="1"                           name="Direct Memory Access Controllor (DMAC)"/>
          <feature type="Timer"         n="6"      m="32"               name="32bit Timer Event counter (T32A)"/>
          <feature type="RTC"           n="1"      m="32768"            name="Real Time Clock (RTC)"/>
          <feature type="UART"          n="3"                           name="Universal Asynchronous Receiver Transmitter (UART)"/>
          <feature type="I2C"           n="2"                           name="Inter-Integrated Circuit (I2C)"/>
          <feature type="SPI"           n="2"                           name="Toshiba Serial Peripheral Interface (TSPI/SIO)"/>
          <feature type="ADC"           n="8"      m="12"               name="Analog to Digital Converter (ADC)"/>
          <feature type="DAC"           n="1"      m="8"                name="Digital to Analog Converter (DAC)"/>
          <feature type="CoreOther"     n="1"                           name="Advanced Encoder input Circuit (A-ENC)"/>
          <feature type="CoreOther"     n="1"                           name="Programmable Motor Driver Plus (PMD+)"/>
          <feature type="Other"         n="1"                           name="Remote control preprocessor (RMC)"/>
          <feature type="PowerOther"    n="1"                           name="Low-Voltage Detector (LVD)"/>
          <feature type="WDT"           n="1"                           name="Selectable clock Watch dog timer (SIWDT)"/>
          <feature type="Other"         n="1"                           name="Oscillation Frequency Detector (OFD)"/>
          <feature type="PowerOther"    n="1"                           name="Power-on Reset Circuit (POR)"/>
          <feature type="VCC"           n="2.70"   m="5.50"/>
          <feature type="Temp"          n="-40"    m="85"/>
          <feature type="QFN"          n="48"    name="P-VQFN48-0606-0.40-003"/>
        </device>

        <!-- ***********************  Device 'TMPM3H2FSQG'  ************************* -->
        <device Dname="TMPM3H2FSQG">
          <processor Dclock="40000000"/>
          <compile header="Device/Include/TMPM3Hx.h" define="TMPM3H2FSQG"/>
          <debug svd="SVD/M3H2.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM3Hx_code_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>
          <algorithm name="Flash/TMPM3Hx_data_16.FLM"  start="0x30000000" size="0x00004000"             default="1"/>

          <!--book name=""/-->

          <feature type="IOs"           n="40"                          name="I/O Ports (PORT)"/>
          <feature type="ExtInt"        n="7"                           name="External interrupt (INT)"/>
          <feature type="CoreOther"     n="1"                           name="Digital Noise Filter (DNF)"/>
          <feature type="DMA"           n="1"                           name="Direct Memory Access Controllor (DMAC)"/>
          <feature type="Timer"         n="6"      m="32"               name="32bit Timer Event counter (T32A)"/>
          <feature type="RTC"           n="1"      m="32768"            name="Real Time Clock (RTC)"/>
          <feature type="UART"          n="3"                           name="Universal Asynchronous Receiver Transmitter (UART)"/>
          <feature type="I2C"           n="2"                           name="Inter-Integrated Circuit (I2C)"/>
          <feature type="SPI"           n="2"                           name="Toshiba Serial Peripheral Interface (TSPI/SIO)"/>
          <feature type="ADC"           n="8"      m="12"               name="Analog to Digital Converter (ADC)"/>
          <feature type="DAC"           n="1"      m="8"                name="Digital to Analog Converter (DAC)"/>
          <feature type="CoreOther"     n="1"                           name="Advanced Encoder input Circuit (A-ENC)"/>
          <feature type="CoreOther"     n="1"                           name="Programmable Motor Driver Plus (PMD+)"/>
          <feature type="Other"         n="1"                           name="Remote control preprocessor (RMC)"/>
          <feature type="PowerOther"    n="1"                           name="Low-Voltage Detector (LVD)"/>
          <feature type="WDT"           n="1"                           name="Selectable clock Watch dog timer (SIWDT)"/>
          <feature type="Other"         n="1"                           name="Oscillation Frequency Detector (OFD)"/>
          <feature type="PowerOther"    n="1"                           name="Power-on Reset Circuit (POR)"/>
          <feature type="VCC"           n="2.70"   m="5.50"/>
          <feature type="Temp"          n="-40"    m="85"/>
          <feature type="QFN"          n="48"    name="P-VQFN48-0606-0.40-003"/>
        </device>

