saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.TXZ3_DFP.1.2.0.pdsc
          <feature type="IOs"           n="36"                          name="I/O Ports (PORT)"/>
          <feature type="ExtInt"        n="6"                           name="External interrupt (INT)"/>
          <feature type="CoreOther"     n="1"                           name="Digital Noise Filter (DNF)"/>
          <feature type="DMA"           n="1"                           name="Direct Memory Access Controllor (DMAC)"/>
          <feature type="Timer"         n="6"      m="32"               name="32bit Timer Event counter (T32A)"/>
          <feature type="UART"          n="3"                           name="Universal Asynchronous Receiver Transmitter (UART)"/>
          <feature type="I2C"           n="2"                           name="Inter-Integrated Circuit (I2C)"/>
          <feature type="SPI"           n="2"                           name="Toshiba Serial Peripheral Interface (TSPI/SIO)"/>
          <feature type="ADC"           n="8"      m="12"               name="Analog to Digital Converter (ADC)"/>
          <feature type="CoreOther"     n="1"                           name="Advanced Encoder input Circuit (A-ENC)"/>
          <feature type="CoreOther"     n="1"                           name="Programmable Motor Driver Plus (PMD+)"/>
          <feature type="Other"         n="1"                           name="Remote control preprocessor (RMC)"/>
          <feature type="PowerOther"    n="1"                           name="Low-Voltage Detector (LVD)"/>
          <feature type="WDT"           n="1"                           name="Selectable clock Watch dog timer (SIWDT)"/>
          <feature type="Other"         n="1"                           name="Oscillation Frequency Detector (OFD)"/>
          <feature type="PowerOther"    n="1"                           name="Power-on Reset Circuit (POR)"/>
          <feature type="VCC"           n="2.70"   m="5.50"/>
          <feature type="Temp"          n="-40"    m="85"/>
          <feature type="QFP"          n="44"    name="LQFP44-P-1010-0.80A"/>
        </device>

        <!-- ***********************  Device 'TMPM3H1FPUG'  ************************* -->
        <device Dname="TMPM3H1FPUG">
          <processor Dclock="40000000"/>
          <compile header="Device/Include/TMPM3Hx.h" define="TMPM3H1FPUG"/>
          <debug svd="SVD/M3H1.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x0000C000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x20000000" size="0x00001800" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM3Hx_code_48.FLM"  start="0x00000000" size="0x0000C000"             default="1"/>
          <algorithm name="Flash/TMPM3Hx_data_8.FLM"   start="0x30000000" size="0x00002000"             default="1"/>

          <!--book name=""/-->

          <feature type="IOs"           n="36"                          name="I/O Ports (PORT)"/>
          <feature type="ExtInt"        n="6"                           name="External interrupt (INT)"/>
          <feature type="CoreOther"     n="1"                           name="Digital Noise Filter (DNF)"/>
          <feature type="DMA"           n="1"                           name="Direct Memory Access Controllor (DMAC)"/>
          <feature type="Timer"         n="6"      m="32"               name="32bit Timer Event counter (T32A)"/>
          <feature type="UART"          n="3"                           name="Universal Asynchronous Receiver Transmitter (UART)"/>
          <feature type="I2C"           n="2"                           name="Inter-Integrated Circuit (I2C)"/>
          <feature type="SPI"           n="2"                           name="Toshiba Serial Peripheral Interface (TSPI/SIO)"/>
          <feature type="ADC"           n="8"      m="12"               name="Analog to Digital Converter (ADC)"/>
          <feature type="CoreOther"     n="1"                           name="Advanced Encoder input Circuit (A-ENC)"/>
          <feature type="CoreOther"     n="1"                           name="Programmable Motor Driver Plus (PMD+)"/>
          <feature type="Other"         n="1"                           name="Remote control preprocessor (RMC)"/>
          <feature type="PowerOther"    n="1"                           name="Low-Voltage Detector (LVD)"/>
          <feature type="WDT"           n="1"                           name="Selectable clock Watch dog timer (SIWDT)"/>
          <feature type="Other"         n="1"                           name="Oscillation Frequency Detector (OFD)"/>
          <feature type="PowerOther"    n="1"                           name="Power-on Reset Circuit (POR)"/>
          <feature type="VCC"           n="2.70"   m="5.50"/>
          <feature type="Temp"          n="-40"    m="85"/>
          <feature type="QFP"          n="44"    name="LQFP44-P-1010-0.80A"/>
        </device>

        <!-- ***********************  Device 'TMPM3H0FSDUG'  ************************* -->
        <device Dname="TMPM3H0FSDUG">
          <processor Dclock="40000000"/>
          <compile header="Device/Include/TMPM3Hx.h" define="TMPM3H0FSDUG"/>
          <debug svd="SVD/M3H0.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM3Hx_code_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>
          <algorithm name="Flash/TMPM3Hx_data_16.FLM"  start="0x30000000" size="0x00004000"             default="1"/>

          <!--book name=""/-->

          <feature type="IOs"           n="24"                          name="I/O Ports (PORT)"/>
          <feature type="ExtInt"        n="6"                           name="External interrupt (INT)"/>
          <feature type="CoreOther"     n="1"                           name="Digital Noise Filter (DNF)"/>
          <feature type="DMA"           n="1"                           name="Direct Memory Access Controllor (DMAC)"/>
          <feature type="Timer"         n="6"      m="32"               name="32bit Timer Event counter (T32A)"/>
          <feature type="UART"          n="2"                           name="Universal Asynchronous Receiver Transmitter (UART)"/>
          <feature type="I2C"           n="1"                           name="Inter-Integrated Circuit (I2C)"/>
          <feature type="SPI"           n="1"                           name="Toshiba Serial Peripheral Interface (TSPI/SIO)"/>
          <feature type="ADC"           n="4"      m="12"               name="Analog to Digital Converter (ADC)"/>
          <feature type="CoreOther"     n="1"                           name="Advanced Encoder input Circuit (A-ENC)"/>
          <feature type="CoreOther"     n="1"                           name="Programmable Motor Driver Plus (PMD+)"/>
          <feature type="Other"         n="1"                           name="Remote control preprocessor (RMC)"/>
          <feature type="PowerOther"    n="1"                           name="Low-Voltage Detector (LVD)"/>
          <feature type="WDT"           n="1"                           name="Selectable clock Watch dog timer (SIWDT)"/>
          <feature type="Other"         n="1"                           name="Oscillation Frequency Detector (OFD)"/>
          <feature type="PowerOther"    n="1"                           name="Power-on Reset Circuit (POR)"/>
          <feature type="VCC"           n="2.70"   m="5.50"/>
          <feature type="Temp"          n="-40"    m="85"/>
          <feature type="QFP"          n="32"    name="P-LQFP32-0707-0.80-002"/>
        </device>

        <!-- ***********************  Device 'TMPM3H0FMDUG'  ************************* -->
        <device Dname="TMPM3H0FMDUG">
          <processor Dclock="40000000"/>
          <compile header="Device/Include/TMPM3Hx.h" define="TMPM3H0FMDUG"/>
          <debug svd="SVD/M3H0.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x20000000" size="0x00001800" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM3Hx_code_32.FLM"  start="0x00000000" size="0x00008000"             default="1"/>
          <algorithm name="Flash/TMPM3Hx_data_8.FLM"   start="0x30000000" size="0x00008000"             default="1"/>

          <!--book name=""/-->

