saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.TXZ3_DFP.1.2.0.pdsc
          <feature type="IOs"           n="56"                          name="I/O Ports (PORT)"/>
          <feature type="ExtInt"        n="12"                          name="External interrupt"/>
          <feature type="CoreOther"     n="1"                           name="Digital Noise Filter (DNF)"/>
          <feature type="DMA"           n="2"                           name="DMAC"/>
          <feature type="Timer"         n="8"      m="32"               name="32bit Timer Event counter (T32A)"/>
          <feature type="RTC"           n="1"      m="32768"/>
          <feature type="UART"          n="6"                           name="Universal Asynchronous Receiver Transmitter (UART)"/>
          <feature type="I2C"           n="4"                           name="Inter-Integrated Circuit (I2C)"/>
          <feature type="SPI"           n="1"                           name="Toshiba Serial Peripheral Interface (TSPI/SIO)"/>
          <feature type="ADC"           n="10"     m="12"               name="Analog to Digital Converter (ADC)"/>
          <feature type="DAC"           n="2"      m="8"                name="Digital to Analog Converter (DAC)"/>
          <feature type="AnalogOther"   n="1"                           name="Comparator (Comp)"/>
          <feature type="CoreOther"     n="1"                           name="Advanced Encoder input Circuit (A-ENC)"/>
          <feature type="CoreOther"     n="1"                           name="Advanst Programmable Motor Driver (A-PMD)"/>
          <feature type="Other"         n="1"                           name="Remote control preprocessor (RMC)"/>
          <feature type="Other"         n="1"                           name="Cyclic Redundancy Check (CRC)"/>
          <feature type="PowerOther"    n="1"                           name="Low-Voltage Detector (LVD)"/>
          <feature type="WDT"           n="1"                           name="Selectable clock Watch dog timer (SIWDT)"/>
          <feature type="Other"         n="1"                           name="Oscillation Frequency Detector (OFD)"/>
          <feature type="PowerOther"    n="1"                           name="Power-on Reset Circuit (POR)"/>
          <feature type="VCC"           n="2.70"   m="5.50"/>
          <feature type="Temp"          n="-40"    m="85"/>
          <feature type="QFP"          n="64"    name="P-LQFP64-1010- 0.50-003"/>
        </device>

      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="TMPM3Hx Compiler">
      <accept condition="Compiler ARMCC"/>
      <accept condition="Compiler IAR"/>   
    </condition>

    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="Compiler IAR">
      <require Tcompiler="IAR"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="TMPM3H6 CMSIS">
      <description>Toshiba TMPM3H6 Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM3H6*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="TMPM3H5 CMSIS">
      <description>Toshiba TMPM3H5 Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM3H5*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="TMPM3H4 CMSIS">
      <description>Toshiba TMPM3H4 Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM3H4*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="TMPM3H3 CMSIS">
      <description>Toshiba TMPM3H3 Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM3H3*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="TMPM3H2 CMSIS">
      <description>Toshiba TMPM3H2 Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM3H2*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="TMPM3H1 CMSIS">
      <description>Toshiba TMPM3H1 Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM3H1*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="TMPM3H0 CMSIS">
      <description>Toshiba TMPM3H0 Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM3H0*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="TMPM3HQ CMSIS">
      <description>Toshiba TMPM3HQ Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM3HQ*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="TMPM3HP CMSIS">
      <description>Toshiba TMPM3HP Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM3HP*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="TMPM3HN_L CMSIS">
      <description>Toshiba TMPM3HN_L Devices and CMSIS-CORE</description>
      <accept Dvendor="Toshiba:92" Dname="TMPM3HNFDLFG"/>
      <accept Dvendor="Toshiba:92" Dname="TMPM3HNFYLFG"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="TMPM3HN CMSIS">
      <description>Toshiba TMPM3HN Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM3HN*"/>
      <deny Dvendor="Toshiba:92" Dname="TMPM3HNFYLFG"/>
      <deny Dvendor="Toshiba:92" Dname="TMPM3HNFDLFG"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="TMPM3HM CMSIS">
      <description>Toshiba TMPM3HM Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM3HM*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="TMPM3HL CMSIS">
      <description>Toshiba TMPM3HL Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM3HL*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>


