saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.TXZ3_DFP.1.2.0.pdsc
  </conditions>

  <components>
    <!-- Startup TMPM3H6 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.3" condition="TMPM3H6 CMSIS">
      <description>System Startup for Toshiba TMPM3H6 Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM3Hx Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM3H6.s" attr="config" version="1.0.3" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM3H6.s" attr="config" version="1.0.3" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM3Hx.c"      attr="config" version="1.0.3" condition="TMPM3Hx Compiler"/>
      </files>
    </component>

    <!-- Startup TMPM3H5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.3" condition="TMPM3H5 CMSIS">
      <description>System Startup for Toshiba TMPM3H5 Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM3Hx Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM3H5.s" attr="config" version="1.0.3" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM3H5.s" attr="config" version="1.0.3" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM3Hx.c"      attr="config" version="1.0.3" condition="TMPM3Hx Compiler"/>
      </files>
    </component>

    <!-- Startup TMPM3H4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.3" condition="TMPM3H4 CMSIS">
      <description>System Startup for Toshiba TMPM3H4 Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM3Hx Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM3H4.s" attr="config" version="1.0.3" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM3H4.s" attr="config" version="1.0.3" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM3Hx.c"      attr="config" version="1.0.3" condition="TMPM3Hx Compiler"/>
      </files>
    </component>

    <!-- Startup TMPM3H3 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.3" condition="TMPM3H3 CMSIS">
      <description>System Startup for Toshiba TMPM3H3 Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM3Hx Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM3H3.s" attr="config" version="1.0.3" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM3H3.s" attr="config" version="1.0.3" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM3Hx.c"      attr="config" version="1.0.3" condition="TMPM3Hx Compiler"/>
      </files>
    </component>

    <!-- Startup TMPM3H2 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.3" condition="TMPM3H2 CMSIS">
      <description>System Startup for Toshiba TMPM3H2 Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM3Hx Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM3H2.s" attr="config" version="1.0.3" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM3H2.s" attr="config" version="1.0.3" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM3Hx.c"      attr="config" version="1.0.3" condition="TMPM3Hx Compiler"/>
      </files>
    </component>

    <!-- Startup TMPM3H1 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.3" condition="TMPM3H1 CMSIS">
      <description>System Startup for Toshiba TMPM3H1 Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM3Hx Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM3H1.s" attr="config" version="1.0.3" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM3H1.s" attr="config" version="1.0.3" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM3Hx.c"      attr="config" version="1.0.3" condition="TMPM3Hx Compiler"/>
      </files>
    </component>

    <!-- Startup TMPM3H0 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.3" condition="TMPM3H0 CMSIS">
      <description>System Startup for Toshiba TMPM3H0 Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM3Hx Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM3H0.s" attr="config" version="1.0.3" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM3H0.s" attr="config" version="1.0.3" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM3Hx.c"      attr="config" version="1.0.3" condition="TMPM3Hx Compiler"/>
      </files>
    </component>

    <!-- Startup TMPM3HQ -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.3" condition="TMPM3HQ CMSIS">
      <description>System Startup for Toshiba TMPM3HQ Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM3Hx Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM3HQ.s" attr="config" version="1.0.3" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM3HQ.s" attr="config" version="1.0.3" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM3Hy.c"      attr="config" version="1.0.3" condition="TMPM3Hx Compiler"/>
      </files>
    </component>

