saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.TXZ3_DFP.1.2.0.pdsc
    <!-- Startup TMPM3HP -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.3" condition="TMPM3HP CMSIS">
      <description>System Startup for Toshiba TMPM3HP Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM3Hx Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM3HP.s" attr="config" version="1.0.3" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM3HP.s" attr="config" version="1.0.3" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM3Hy.c"      attr="config" version="1.0.3" condition="TMPM3Hx Compiler"/>
      </files>
    </component>

    <!-- Startup TMPM3HN -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.3" condition="TMPM3HN CMSIS">
      <description>System Startup for Toshiba TMPM3HN Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM3Hx Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM3HN.s" attr="config" version="1.0.3" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM3HN.s" attr="config" version="1.0.3" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM3Hy.c"      attr="config" version="1.0.3" condition="TMPM3Hx Compiler"/>
      </files>
    </component>

    <!-- Startup TMPM3HN_L -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.3" condition="TMPM3HN_L CMSIS">
      <description>System Startup for Toshiba TMPM3HN_L Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM3HN_L.s" attr="config" version="1.0.3" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM3Hy.c"      attr="config" version="1.0.3" condition="Compiler ARMCC"/>
      </files>
    </component>

    <!-- Startup TMPM3HM -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.3" condition="TMPM3HM CMSIS">
      <description>System Startup for Toshiba TMPM3HM Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM3Hx Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM3HM.s" attr="config" version="1.0.3" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM3HM.s" attr="config" version="1.0.3" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM3Hy.c"      attr="config" version="1.0.3" condition="TMPM3Hx Compiler"/>
      </files>
    </component>

    <!-- Startup TMPM3HL -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.3" condition="TMPM3HL CMSIS">
      <description>System Startup for Toshiba TMPM3HL Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM3HL.s" attr="config" version="1.0.3" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM3Hy.c"      attr="config" version="1.0.3" condition="Compiler ARMCC"/>
      </files>
    </component>

  </components>

</package>
